# Найти и вывести на экран квадраты и кубы чисел от 2 до 5.

for i in range(2, 6):
    print('Число', i, '. Его квадрат:', i**2, ', его куб:', i**3)

